#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.yc-vpc.data.yandex_client_config.client: Reading...
module.yc-vpc.data.yandex_client_config.client: Read complete after 0s [id=1024083183]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # yandex_api_gateway.ai-radio-static-gateway will be created
  + resource "yandex_api_gateway" "ai-radio-static-gateway" {
      + created_at        = (known after apply)
      + domain            = (known after apply)
      + execution_timeout = (known after apply)
      + folder_id         = (known after apply)
      + id                = (known after apply)
      + log_group_id      = (known after apply)
      + name              = "ai-radio-static-gateway"
      + spec              = <<-EOT
            openapi: "3.0.0"
            info:
              version: 1.0.0
              title: ai-radio static
            x-yc-apigateway:
              service_account_id: ${ai-radio-container-sa-id}
            
            paths:
              /:
                get:
                  operationId: index
                  x-yc-apigateway-integration:
                    type: object_storage
                    bucket: ${ai-radio-website-bucket-name}
                    object: 'index.html'
              /{file+}:
                get:
                  operationId: website
                  parameters:
                    - name: file
                      in: path
                      required: false
                      schema:
                        type: string
                  x-yc-apigateway-integration:
                    type: object_storage
                    bucket: ${ai-radio-website-bucket-name}
                    object: '{file}'
              /images/{file+}:
                get:
                  operationId: posters
                  parameters:
                    - name: file
                      in: path
                      required: false
                      schema:
                        type: string
                  x-yc-apigateway-integration:
                    type: object_storage
                    bucket: ${ai-radio-images-bucket-name}
                    object: '{file}'
        EOT
      + status            = (known after apply)
      + user_domains      = (known after apply)
    }

  # yandex_container_registry.ai-radio-registry will be created
  + resource "yandex_container_registry" "ai-radio-registry" {
      + created_at = (known after apply)
      + folder_id  = "b1g2inpl68al98r9ock7"
      + id         = (known after apply)
      + name       = "ai-radio-registry"
      + status     = (known after apply)
    }

  # yandex_container_registry_iam_binding.puller will be created
  + resource "yandex_container_registry_iam_binding" "puller" {
      + id          = (known after apply)
      + members     = [
          + "system:group:organization:bpf7g9i7n7ntnksbdvlr:users",
        ]
      + registry_id = (known after apply)
      + role        = "container-registry.images.puller"
    }

  # yandex_container_repository.caster will be created
  + resource "yandex_container_repository" "caster" {
      + id   = (known after apply)
      + name = (known after apply)
    }

  # yandex_dns_recordset.ai-cloud-a-1 will be created
  + resource "yandex_dns_recordset" "ai-cloud-a-1" {
      + data    = (known after apply)
      + id      = (known after apply)
      + name    = "@"
      + ttl     = 600
      + type    = "A"
      + zone_id = (known after apply)
    }

  # yandex_dns_recordset.ai-cloud-a-2 will be created
  + resource "yandex_dns_recordset" "ai-cloud-a-2" {
      + data    = (known after apply)
      + id      = (known after apply)
      + name    = "*"
      + ttl     = 600
      + type    = "A"
      + zone_id = (known after apply)
    }

  # yandex_dns_recordset.ai-cloud-aname-1 will be created
  + resource "yandex_dns_recordset" "ai-cloud-aname-1" {
      + data    = [
          + "ai-cloud.ru",
        ]
      + id      = (known after apply)
      + name    = "www"
      + ttl     = 600
      + type    = "ANAME"
      + zone_id = (known after apply)
    }

  # yandex_dns_recordset.ai-cloud-txt-1 will be created
  + resource "yandex_dns_recordset" "ai-cloud-txt-1" {
      + data    = [
          + "_globalsign-domain-verification=BnGJeP9SYFsqs0D2V5N2AVirW5IouTlYZ2CUcFqxuQ",
        ]
      + id      = (known after apply)
      + name    = "@"
      + ttl     = 600
      + type    = "TXT"
      + zone_id = (known after apply)
    }

  # yandex_dns_zone.ai-cloud-zone will be created
  + resource "yandex_dns_zone" "ai-cloud-zone" {
      + created_at          = (known after apply)
      + deletion_protection = true
      + description         = "dns zone"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "ai-cloud-zone"
      + private_networks    = (known after apply)
      + public              = true
      + zone                = "ai-cloud.ru."
    }

  # yandex_iam_service_account.ai-radio-base-sa will be created
  + resource "yandex_iam_service_account" "ai-radio-base-sa" {
      + created_at  = (known after apply)
      + description = "Basic service account for ai-radio"
      + folder_id   = (known after apply)
      + id          = (known after apply)
      + name        = "ai-radio-base-sa"
    }

  # yandex_iam_service_account_static_access_key.ai-radio-static-key will be created
  + resource "yandex_iam_service_account_static_access_key" "ai-radio-static-key" {
      + access_key                   = (known after apply)
      + created_at                   = (known after apply)
      + encrypted_secret_key         = (known after apply)
      + id                           = (known after apply)
      + key_fingerprint              = (known after apply)
      + output_to_lockbox_version_id = (known after apply)
      + secret_key                   = (sensitive value)
      + service_account_id           = (known after apply)
    }

  # yandex_storage_bucket.ai-radio-images-bucket will be created
  + resource "yandex_storage_bucket" "ai-radio-images-bucket" {
      + access_key            = (known after apply)
      + bucket                = "ai-radio-images"
      + bucket_domain_name    = (known after apply)
      + default_storage_class = (known after apply)
      + folder_id             = (known after apply)
      + force_destroy         = false
      + id                    = (known after apply)
      + secret_key            = (sensitive value)
      + website_domain        = (known after apply)
      + website_endpoint      = (known after apply)

      + anonymous_access_flags (known after apply)

      + versioning (known after apply)
    }

  # yandex_storage_bucket.ai-radio-website-bucket will be created
  + resource "yandex_storage_bucket" "ai-radio-website-bucket" {
      + access_key            = (known after apply)
      + bucket                = "ai-radio-website"
      + bucket_domain_name    = (known after apply)
      + default_storage_class = (known after apply)
      + folder_id             = (known after apply)
      + force_destroy         = false
      + id                    = (known after apply)
      + secret_key            = (sensitive value)
      + website_domain        = (known after apply)
      + website_endpoint      = (known after apply)

      + anonymous_access_flags (known after apply)

      + versioning (known after apply)
    }

  # yandex_vpc_address.ai-cloud-gateway-ip will be created
  + resource "yandex_vpc_address" "ai-cloud-gateway-ip" {
      + created_at          = (known after apply)
      + deletion_protection = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = "ai-cloud-gateway-ip"
      + reserved            = (known after apply)
      + used                = (known after apply)

      + external_ipv4_address {
          + address                  = (known after apply)
          + ddos_protection_provider = "qrator"
          + outgoing_smtp_capability = (known after apply)
          + zone_id                  = "ru-central1-d"
        }
    }

  # module.yc-vpc.yandex_vpc_default_security_group.default_sg[0] will be created
  + resource "yandex_vpc_default_security_group" "default_sg" {
      + created_at  = (known after apply)
      + description = "Default security group"
      + folder_id   = "b1g2inpl68al98r9ock7"
      + id          = (known after apply)
      + labels      = {
          + "created_by" = "terraform-yc-module"
        }
      + name        = (known after apply)
      + network_id  = (known after apply)
      + status      = (known after apply)

      + egress {
          + description       = "To internet"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }

      + ingress {
          + description       = "Communication inside this SG"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "self_security_group"
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + description       = "ICMP"
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ICMP"
          + to_port           = 65535
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "NLB health check"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "loadbalancer_healthchecks"
          + protocol          = "TCP"
          + to_port           = -1
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + description       = "RDP"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = 3389
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "ssh"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = 22
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
    }

  # module.yc-vpc.yandex_vpc_gateway.egress_gateway[0] will be created
  + resource "yandex_vpc_gateway" "egress_gateway" {
      + created_at = (known after apply)
      + folder_id  = "b1g2inpl68al98r9ock7"
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "ai-radio-network-egress-gateway"

      + shared_egress_gateway {}
    }

  # module.yc-vpc.yandex_vpc_network.this[0] will be created
  + resource "yandex_vpc_network" "this" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + description               = "Basic network for ai-radio app"
      + folder_id                 = "b1g2inpl68al98r9ock7"
      + id                        = (known after apply)
      + labels                    = {
          + "created_by" = "terraform-yc-module"
        }
      + name                      = "ai-radio-network"
      + subnet_ids                = (known after apply)
    }

  # module.yc-vpc.yandex_vpc_route_table.private[0] will be created
  + resource "yandex_vpc_route_table" "private" {
      + created_at = (known after apply)
      + folder_id  = "b1g2inpl68al98r9ock7"
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "ai-radio-network-private"
      + network_id = (known after apply)

      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.yc-vpc.yandex_vpc_subnet.private["192.168.15.0/24"] will be created
  + resource "yandex_vpc_subnet" "private" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = {
          + "created_by" = "terraform-yc-module"
        }
      + name           = "subnet-2"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.15.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"

      + dhcp_options {
          + domain_name         = "internal."
          + domain_name_servers = []
          + ntp_servers         = []
        }
    }

  # module.yc-vpc.yandex_vpc_subnet.private["192.168.5.0/24"] will be created
  + resource "yandex_vpc_subnet" "private" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = {
          + "created_by" = "terraform-yc-module"
        }
      + name           = "subnet-1"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.5.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-d"

      + dhcp_options {
          + domain_name         = "internal."
          + domain_name_servers = []
          + ntp_servers         = []
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ai-radio-base-sa-id          = (known after apply)
  + ai-radio-images-bucket-name  = "ai-radio-images"
  + ai-radio-website-bucket-name = "ai-radio-website"
  + caster_name                  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @valeter, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Yandex Cloud Integration check`*